krogla_2stl_1file/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.14;

boundaryField
{
    movingWall
    {
        type            freestream;
        freestreamValue $internalField;
    }

    front
    {
        type            freestream;
        freestreamValue $internalField;
    }

    back
    {
	    type 		    freestream;
	    freestreamValue $internalField;
    }			
	
	sfera1
    {
        type            nutUWallFunction;
        value           $internalField;
    }

	sfera2
    {
        type            nutUWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
